src/Catalogs/ПлощадкиЭксплуатации/ПлощадкиЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПлощадкиЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ЕдиницаКонтроля</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипЭлементаПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/НастройкиКонтрольПодключений/НастройкиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПодключений</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеханизмПроверкиОбрабатыватьИзменения</name>
    <type>
      <types>EnumRef.МеханизмыПроверкиПодключения</types>
    </type>
  </resources>
  <resources>
    <name>URLОпубликованнойИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛогинПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПарольПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПроверятьПоЖурналуРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <comment>Максимальное время выполнения контрольной процедуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/МеханизмыПроверкиПодключения/МеханизмыПроверкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МеханизмыПроверкиПодключения</name>
  <enumValues>
    <name>COMСоединитель</name>
  </enumValues>
  <enumValues>
    <name>WEBСервис</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПлощадкиЭксплуатации/Forms/ФормаГруппыКонтрольПодключений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()

    Настройки = РегистрыСведений.НастройкиКонтрольПодключений.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений());
    
    ЭтотОбъект.ЛогинПриПодключении = Настройки.ЛогинПриПодключении;
    ЭтотОбъект.ПарольПриПодключении = Настройки.ПарольПриПодключении;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "МеханизмПроверкиОбрабатыватьИзменения";
    НовСтрока.ПараметрПредставление = "Способ подключения";
    НовСтрока.ПараметрЗначение = Настройки.МеханизмПроверкиОбрабатыватьИзменения;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "URLОпубликованнойИнформационнойБазы";
    НовСтрока.ПараметрПредставление = "Строка соединения";
    Если Настройки.МеханизмПроверкиОбрабатыватьИзменения = Перечисления.МеханизмыПроверкиПодключения.WEBСервис Тогда 
        НовСтрока.ПараметрЗначение = Настройки.URLОпубликованнойИнформационнойБазы;
    ИначеЕсли Настройки.МеханизмПроверкиОбрабатыватьИзменения = Перечисления.МеханизмыПроверкиПодключения.COMСоединитель Тогда
        НовСтрока.ПараметрЗначение = Настройки.СтрокаСоединения;
    Иначе
        НовСтрока.ПараметрЗначение = Настройки.URLОпубликованнойИнформационнойБазы;
    КонецЕсли;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "Таймаут";
    НовСтрока.ПараметрПредставление = "Таймаут";
    НовСтрока.ПараметрЗначение = Настройки.Таймаут;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ИспользоватьПрокси";
    НовСтрока.ПараметрПредставление = "Использовать прокси";
    НовСтрока.ПараметрЗначение = Настройки.ИспользоватьПрокси;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ПроксиСервер";
    НовСтрока.ПараметрПредставление = "Сервер прокси";
    НовСтрока.ПараметрЗначение = Настройки.ПроксиСервер;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ПроксиПорт";
    НовСтрока.ПараметрПредставление = "Порт прокси сервера";
    НовСтрока.ПараметрЗначение = Настройки.ПроксиПорт;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ПериодКонтроля";
    НовСтрока.ПараметрПредставление = "Период контроля, сек.";
    НовСтрока.ПараметрЗначение = Настройки.ПериодКонтроля;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "МинимальныйПроцентДоступности";
    НовСтрока.ПараметрПредставление = "Минимальная доступность, %";
    НовСтрока.ПараметрЗначение = Настройки.МинимальныйПроцентДоступности;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ДопустимоНетДанных";
    НовСтрока.ПараметрПредставление = "Допустимо нет данных, сек.";
    НовСтрока.ПараметрЗначение = Настройки.ДопустимоНетДанных;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        
        Если ТекПараметр.Параметр <> "URLОпубликованнойИнформационнойБазы" Тогда
            Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
        Иначе
            URLОпубликованнойИнформационнойБазы = ТекПараметр.ПараметрЗначение;
        КонецЕсли;
        
        Если ТекПараметр.Параметр = "МеханизмПроверкиОбрабатыватьИзменения" Тогда
            МеханизмПроверкиОбрабатыватьИзменения = ТекПараметр.ПараметрЗначение;
        КонецЕсли;
        
    КонецЦикла;
    
    Если МеханизмПроверкиОбрабатыватьИзменения = Перечисления.МеханизмыПроверкиПодключения.WEBСервис Тогда
        Настройки.Вставить("URLОпубликованнойИнформационнойБазы", URLОпубликованнойИнформационнойБазы);
        Настройки.Вставить("СтрокаСоединения", "");
    ИначеЕсли МеханизмПроверкиОбрабатыватьИзменения = Перечисления.МеханизмыПроверкиПодключения.COMСоединитель Тогда
        Настройки.Вставить("URLОпубликованнойИнформационнойБазы", "");
        Настройки.Вставить("СтрокаСоединения", URLОпубликованнойИнформационнойБазы);
    Иначе
        Настройки.Вставить("URLОпубликованнойИнформационнойБазы", URLОпубликованнойИнформационнойБазы);
        Настройки.Вставить("СтрокаСоединения", "");
    КонецЕсли;
        
    Настройки.Вставить("ЛогинПриПодключении", ЭтотОбъект.ЛогинПриПодключении);
    Настройки.Вставить("ПарольПриПодключении", ЭтотОбъект.ПарольПриПодключении);
    
    РегистрыСведений.НастройкиКонтрольПодключений.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений(), Настройки);
    
КонецПроцедуры

#КонецОбласти
